cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "argon/mas"
tap "bannzai/kuri"
tap "go-delve/delve"
brew "bannzai/kuri/kuri"
tap "heroku/brew"
brew "heroku/brew/heroku"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/science"
tap "homebrew/services"
tap "homebrew/versions"
tap "neovim/neovim"

brew "bitrise"
brew "carthage"
brew "chisel"
brew "cmake"
brew "ctags"
brew "direnv"
brew "elasticsearch@2.4"
brew "libtool"
brew "gcc"
brew "git"
brew "ghi"
brew "go"
brew "pkg-config"
brew "goenv"
brew "openssl"
brew "readline"
brew "grip"
brew "hub"
brew "python"
brew "libxml2"
brew "usbmuxd", args: ["HEAD"]
brew "ideviceinstaller"
brew "imagemagick@6", link: true
brew "jq"
brew "libevent"
brew "libogg"
brew "libressl"
brew "libvorbis"
brew "libvpx"
brew "lua"
brew "lua@5.1"
brew "mitmproxy"
brew "mysql"
brew "ncurses"
brew "neovim"
brew "ninja", link: false
brew "nodenv"
brew "openblas"
brew "openapi-generator"
brew "tbb"
brew "opencv"
brew "opus"
brew "pcre2"
brew "postgresql"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis"
brew "rmtrash"
brew "the_silver_searcher"
brew "theora"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "x265"
brew "zsh"
brew "zsh-completions"
brew 'homeshick'
brew 'fzf'

cask "google-chrome"
cask "sketch"
cask "bettertouchtool"
cask "visual-studio-code"
cask "reveal"
cask "tableplus"
cask "dropbox"
cask "docker"
cask "coteditor"
cask "licecap"
cask "discord"
cask "kactus"
cask "android-studio"
cask "vimr"
cask "abstract"
cask "dash"
cask "cmd-eikana"

mas "Xcode", id: 497799835
mas "Alfred", id: 405843582
mas "Wunderlist", id: 410628904
mas "Slack", id: 803453959
mas "Skype", id: 909323225
mas "LINE", id: 539883307
mas "Keynote", id: 409183694


